# 판다스 연습 튜토리얼
- https://www.datamanim.com/dataset/99_pandas/pandasMain.html

## 04_Apply , Map
Attention

카드이용데이터 : https://www.kaggle.com/sakshigoyal7/credit-card-customers  
DataUrl =‘https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv’

In [1]:
import pandas as pd
import numpy as np

### Question 56

데이터를 로드하고 데이터 행과 열의 갯수를 출력하라

In [2]:
DataUrl = 'https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv'
df = pd.read_csv(DataUrl, index_col=0)

df.shape

(10127, 18)

### Question 57

Income_Category의 카테고리를 map 함수를 이용하여 다음과 같이 변경하여 newIncome 컬럼에 매핑하라  
Unknown : N   
Less than 40K : a  
40K - 60K : b  
60K - 80K : c  
80K - 120K : d  
120K + : e

In [3]:
df['Income_Category'].unique().tolist()

['$60K - $80K',
 'Less than $40K',
 '$80K - $120K',
 '$40K - $60K',
 '$120K +',
 'Unknown']

In [4]:
mapping = {
    'Unknown' : 'N',
    'Less than $40K' : 'a',
    '$40K - $60K' : 'b',
    '$60K - $80K' : 'c',
    '$80K - $120K' : 'd',
    '$120K +' : 'e'
}

In [5]:
df['newIncome'] = df['Income_Category'].map(lambda x: mapping[x])
df[['Income_Category', 'newIncome']]

      Income_Category newIncome
0         $60K - $80K         c
1      Less than $40K         a
2        $80K - $120K         d
3      Less than $40K         a
4         $60K - $80K         c
...               ...       ...
10122     $40K - $60K         b
10123     $40K - $60K         b
10124  Less than $40K         a
10125     $40K - $60K         b
10126  Less than $40K         a

[10127 rows x 2 columns]

### Question 58

Income_Category의 카테고리를 apply 함수를 이용하여 다음과 같이 변경하여 newIncome 컬럼에 매핑하라

In [6]:
def mapping(x):
    if x == 'Unknown' :
        return 'N'
    elif x == 'Less than $40K':
        return 'a'
    elif x == '$40K - $60K':
        return 'b'
    elif x == '$60K - $80K':
        return 'c'
    elif x == '$80K - $120K':
        return 'd'
    elif x == '$120K +':
        return 'e'

In [7]:
df['newIncome'] = df['Income_Category'].apply(mapping)
df[['Income_Category', 'newIncome']]

      Income_Category newIncome
0         $60K - $80K         c
1      Less than $40K         a
2        $80K - $120K         d
3      Less than $40K         a
4         $60K - $80K         c
...               ...       ...
10122     $40K - $60K         b
10123     $40K - $60K         b
10124  Less than $40K         a
10125     $40K - $60K         b
10126  Less than $40K         a

[10127 rows x 2 columns]

### Question 59

Customer_Age의 값을 이용하여 나이 구간을 AgeState 컬럼으로 정의하라. (0~9 : 0 , 10~19 :10 , 20~29 :20 … 각 구간의 빈도수를 출력하라

In [8]:
df['AgeState']  = df['Customer_Age'].map(lambda x: x // 10 * 10)
df[['Customer_Age','AgeState']]

       Customer_Age  AgeState
0                45        40
1                49        40
2                51        50
3                40        40
4                40        40
...             ...       ...
10122            50        50
10123            41        40
10124            44        40
10125            30        30
10126            43        40

[10127 rows x 2 columns]

In [9]:
q59 = df['AgeState'].value_counts().sort_index()
q59

20     195
30    1841
40    4561
50    2998
60     530
70       2
Name: AgeState, dtype: int64

### Question 60

Education_Level의 값중 Graduate단어가 포함되는 값은 1 그렇지 않은 경우에는 0으로 변경하여 newEduLevel 컬럼을 정의하고 빈도수를 출력하라

In [10]:
df['newEduLevel'] = df['Education_Level'].apply(lambda x: 1 if 'Graduate' in x else 0)
df[['Education_Level', 'newEduLevel']]

      Education_Level  newEduLevel
0         High School            0
1            Graduate            1
2            Graduate            1
3         High School            0
4          Uneducated            0
...               ...          ...
10122        Graduate            1
10123         Unknown            0
10124     High School            0
10125        Graduate            1
10126        Graduate            1

[10127 rows x 2 columns]

In [11]:
q60 = df['newEduLevel'].value_counts()
q60

0    6483
1    3644
Name: newEduLevel, dtype: int64

### Question 61

Credit_Limit 컬럼값이 4500 이상인 경우 1 그외의 경우에는 모두 0으로 하는 newLimit 정의하라.  
newLimit 각 값들의 빈도수를 출력하라

In [12]:
df['newLimit'] = df['Credit_Limit'].apply(lambda x: 1 if x >=4500 else 0)
df[['Credit_Limit', 'newLimit']]

       Credit_Limit  newLimit
0           12691.0         1
1            8256.0         1
2            3418.0         0
3            3313.0         0
4            4716.0         1
...             ...       ...
10122        4003.0         0
10123        4277.0         0
10124        5409.0         1
10125        5281.0         1
10126       10388.0         1

[10127 rows x 2 columns]

In [13]:
q61 = df['newLimit'].value_counts()
q61

1    5096
0    5031
Name: newLimit, dtype: int64

### Question 62

Marital_Status 컬럼값이 Married 이고 Card_Category 컬럼의 값이 Platinum인 경우 1 그외의 경우에는 모두 0으로 하는 newState컬럼을 정의하라.  
newState의 각 값들의 빈도수를 출력하라

In [14]:
df.columns

Index(['CLIENTNUM', 'Attrition_Flag', 'Customer_Age', 'Gender',
       'Dependent_count', 'Education_Level', 'Marital_Status',
       'Income_Category', 'Card_Category', 'Months_on_book',
       'Total_Relationship_Count', 'Months_Inactive_12_mon',
       'Contacts_Count_12_mon', 'Credit_Limit', 'Total_Revolving_Bal',
       'Avg_Open_To_Buy', 'Total_Amt_Chng_Q4_Q1', 'Total_Trans_Amt',
       'newIncome', 'AgeState', 'newEduLevel', 'newLimit'],
      dtype='object')

In [15]:
def newstate(x):
    if x['Marital_Status'] == 'Married' and x['Card_Category'] == 'Platinum':
        return 1
    else :
        return 0

In [16]:
df['newState'] = df.apply(newstate, axis=1)
df[['Marital_Status', 'Card_Category', 'newState']]

      Marital_Status Card_Category  newState
0            Married          Blue         0
1             Single          Blue         0
2            Married          Blue         0
3            Unknown          Blue         0
4            Married          Blue         0
...              ...           ...       ...
10122         Single          Blue         0
10123       Divorced          Blue         0
10124        Married          Blue         0
10125        Unknown          Blue         0
10126        Married        Silver         0

[10127 rows x 3 columns]

In [17]:
q62 = df['newState'].value_counts()
q62

0    10120
1        7
Name: newState, dtype: int64

In [18]:
df.loc[df['newState'] == 1][['Marital_Status', 'Card_Category']]

     Marital_Status Card_Category
3800        Married      Platinum
8863        Married      Platinum
9071        Married      Platinum
9113        Married      Platinum
9306        Married      Platinum
9319        Married      Platinum
9618        Married      Platinum

### Question 63

Gender 컬럼값 M인 경우 male F인 경우 female로 값을 변경하여 Gender 컬럼에 새롭게 정의하라. 각 value의 빈도를 출력하라

In [19]:
df['Gender'].value_counts()

F    5358
M    4769
Name: Gender, dtype: int64

In [20]:
df['Gender'] = df['Gender'].apply(lambda x: 'male' if x == 'M' else 'female')
df['Gender'].value_counts()

female    5358
male      4769
Name: Gender, dtype: int64